Tekla.Structures.Model.WorkPlaneHandler
The WorkPlaneHandler class contains methods for getting and setting
the current transformation plane.

Tekla.Structures.Model.WorkPlaneHandler.#ctor
Internal constructor for WorkPlaneHander.
Should be instantiated only from Model.

Tekla.Structures.Model.WorkPlaneHandler.GetCurrentTransformationPlane
Gets the current transformation plane.
Returns: The current transformation plane.

Tekla.Structures.Model.WorkPlaneHandler.SetCurrentTransformationPlane(Tekla.Structures.Model.TransformationPlane)
Sets the current transformation plane.
Remarks:
Please note that in order to see workplane change visible in the model,
use the Tekla.Structures.Model.UI.ViewHandler.RedrawWorkplane method of
the Tekla.Structures.Model.UI.ViewHandler class.
TransformationPlane: The transformation plane to be set as the current transformation plane.
Returns: False on failure.